In [2]:
import pandas as pd

# Define tidy data:
1. Each variable forms a column.
2. Each observation forms a row.
3. Each type of observational unit forms a table.

# Define messy data
1. Column headers are values, not variable name
    -  common type of messy dataset is tabular data designed for presentation, where variables form both the rows and columns, and column headers are values, not variable names
2. Multiple variables are stored in one column
    - After melting, thecolumnvariable names often becomes a combination of multiple underlyingvariable  names.
3. Variables are stored in both rows and columns
4. Multiple types of observation units are stored in the same table
5. Single observation unit is stored in multiple tables

## 1. Column headers are values, not variable name example:

In [3]:
income_df = pd.read_csv('data/data_cleaning_melt.csv')
income_df.head()

,religion,<$10k,$10-20k,$20-30k,$30-40k,$40-50k,$50-75k,$75-100k,$100-150k,>150k,Don't know/refused
0,Agnostic,27,34,60,81,76,137,122,109,84,96
1,Atheist,12,27,37,52,35,70,73,59,74,76
2,Buddhist,27,21,30,34,33,58,62,39,53,54
3,Catholic,418,617,732,670,638,1116,949,792,633,1489
4,Don’t know/refused,15,14,15,11,10,35,21,17,18,116

### In order to tidy this data we should use melt method

In [4]:
melted_income_df = pd.melt(income_df, id_vars=['religion'], var_name="Income", value_name='Frequency')
melted_income_df.head()

             religion Income  Frequency
0            Agnostic  <$10k         27
1             Atheist  <$10k         12
2            Buddhist  <$10k         27
3            Catholic  <$10k        418
4  Don’t know/refused  <$10k         15

### Another example of this messy data is:

In [5]:
billboard_df = pd.read_csv('data/data_cleaning_melt2.csv')
billboard_df.head()

,"r""",artist.inverted,track,time,genre,date.entered,date.peaked,x1st.week,x2nd.week,x3rd.week,...,x67th.week,x68th.week,x69th.week,x70th.week,x71st.week,x72nd.week,x73rd.week,x74th.week,x75th.week,x76th.week
0,2000,Destiny's Child,Independent Women Part I,3:38,Rock,2000-09-23,2000-11-18,78,63.0,49.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2000,Santana,"Maria, Maria",4:18,Rock,2000-02-12,2000-04-08,15,8.0,6.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,2000,Savage Garden,I Knew I Loved You,4:07,Rock,1999-10-23,2000-01-29,71,48.0,43.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,2000,Madonna,Music,3:45,Rock,2000-08-12,2000-09-16,41,23.0,18.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,2000,"Aguilera, Christina",Come On Over Baby (All I Want Is You),3:38,Rock,2000-08-05,2000-10-14,57,47.0,45.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [6]:
melted_billboard_df = pd.melt(
    billboard_df,
    id_vars=['r"', "artist.inverted", "track","time",
             "genre", "date.entered", "date.peaked"],
    var_name='week', value_name='rank')
melted_billboard_df.head()

,"r""",artist.inverted,track,time,genre,date.entered,date.peaked,week,rank
0,2000,Destiny's Child,Independent Women Part I,3:38,Rock,2000-09-23,2000-11-18,x1st.week,78.0
1,2000,Santana,"Maria, Maria",4:18,Rock,2000-02-12,2000-04-08,x1st.week,15.0
2,2000,Savage Garden,I Knew I Loved You,4:07,Rock,1999-10-23,2000-01-29,x1st.week,71.0
3,2000,Madonna,Music,3:45,Rock,2000-08-12,2000-09-16,x1st.week,41.0
4,2000,"Aguilera, Christina",Come On Over Baby (All I Want Is You),3:38,Rock,2000-08-05,2000-10-14,x1st.week,57.0

# 2. Multiple variables are stored in one column example:

In [7]:
tb_df = pd.read_csv('data/tuberculosis_multi_vars.csv')
tb_df.drop(['new_sp', "new_sp_fu"], axis=1, inplace=True)
melted_tb_df = pd.melt(tb_df, id_vars=['so2', 'year'], var_name='gender_and_age_group', value_name='frequency')
melted_tb_df.head()

  so2  year gender_and_age_group  frequency
0  AD  1989           new_sp_m04        NaN
1  AD  1990           new_sp_m04        NaN
2  AD  1991           new_sp_m04        NaN
3  AD  1992           new_sp_m04        NaN
4  AD  1993           new_sp_m04        NaN

### After melting, our column gender and age group contains information about 2 variables(e.x. m04: m = male, 04 = from 0 to 4 age group)

In [8]:
def convert_to_age_group(age):
    if age.startswith('0'):
        return f"0-{age[1:]}"
    elif age.startswith('6'):
      return "65+"
    else:
        return f"{age[:2]}-{age[2:]}"
variable_split = melted_tb_df['gender_and_age_group'].str.replace('new_sp_', '')
melted_tb_df['age'] = variable_split.str[1:].apply(convert_to_age_group)
melted_tb_df['gender'] = variable_split.str[0]
melted_tb_df.drop('gender_and_age_group', axis=1, inplace=True)
melted_tb_df.head()

  so2  year  frequency  age gender
0  AD  1989        NaN  0-4      m
1  AD  1990        NaN  0-4      m
2  AD  1991        NaN  0-4      m
3  AD  1992        NaN  0-4      m
4  AD  1993        NaN  0-4      m

# 3. Variables are stored in both rows and columns example:

In [12]:
weather_df = pd.read_csv('data/weather_vars_in_rows.csv')
weather_df.head()

,id,year,month,element,d1,d2,d3,d4,d5,d6,...,d22,d23,d24,d25,d26,d27,d28,d29,d30,d31
0,MX17004,2010,1,tmax,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,27.8,NaN
1,MX17004,2010,1,tmin,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,14.5,NaN
2,MX17004,2010,2,tmax,NaN,27.3,24.1,NaN,NaN,NaN,...,NaN,29.9,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,MX17004,2010,2,tmin,NaN,14.4,14.4,NaN,NaN,NaN,...,NaN,10.7,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,MX17004,2010,3,tmax,NaN,NaN,NaN,NaN,32.1,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

### Besides our df have variables in header, in our rows there is variable valled tmin and tmax
### 1. Melt our data

In [13]:
melted_weather_df = pd.melt(weather_df, id_vars=['id', "year", 'month', "element"],
                            var_name='day',
                            value_name='temp')
melted_weather_df.head()

        id  year  month element day  temp
0  MX17004  2010      1    tmax  d1   NaN
1  MX17004  2010      1    tmin  d1   NaN
2  MX17004  2010      2    tmax  d1   NaN
3  MX17004  2010      2    tmin  d1   NaN
4  MX17004  2010      3    tmax  d1   NaN

### 2. Use pivot method, in order two make row variable as a column:

In [20]:
cleaned_weather_df = melted_weather_df.pivot(
    index=['id', 'year', 'month', 'day'],
    columns='element',
    values='temp'
).reset_index()
cleaned_weather_df.head()

element       id  year  month  day  tmax  tmin
0        MX17004  2010      1   d1   NaN   NaN
1        MX17004  2010      1  d10   NaN   NaN
2        MX17004  2010      1  d11   NaN   NaN
3        MX17004  2010      1  d12   NaN   NaN
4        MX17004  2010      1  d13   NaN   NaN